{
  "header": {
    "solutions": "Produts & Solutions",
    "knowledge": "Knowledge Center",
    "about": "About Us",
    "contect": "Connect Wallet",
    "compliance":"About & Compliance",
      "support":"",
      "lang": "Language",
      
      "dashboard": "Dashboard",
      "family": "Family Trust",
      "enterprise": "Enterprise Trust",
      "dao": "Dao Governance",
      "rwa": "RWA",
      "vesting": "Vesting",
      "compliance2": "Compliance",
      "overview": "Overview",
      "analysis": "Industry Analysis",
      "vision": "Platform Vision",
      "architecture": "Business Architecture",
      "product": "Products",
      "security": "Security Design",
      "legal":"Legal & Compliance",
      "case": "Use Cases & Case Studies",
      "governance": "Governance",
      "roadmap": "Roadmap",
      "risk": "Risk Disclosure"
  },
  "home": {
    "slogon": "On-Chain Trust ",
    "slogon2": "Behind Decentralized Wealth",
    "subslogon": "We integrate licensed trust structures with blockchain technology, moving fiduciary management and profit distribution onto the chain to provide transparent, programmable, and auditable wealth inheritance solutions for clients of all sizes",
    "slogonbutton": "Consult On-Chain Trust Experts",
    "feature1": "Products & Solutions",
    "feature2": "On-Chain Advantages",
    "feature3": "Curations",
    "feature4": "Regions",

    "assetdiscover": "Asset Discovery",
    "createTrust": "Create Trust",
    "createTrustDESC1": "A compliant pathway in collaboration with licensed trust institutions. We translate the legal and regulatory requirements of traditional trusts",
    "createTrustDESC2": "into seamless on-chain programmable distribution capabilities: low minimum investment, transparent processes, and full traceability throughout the entire journey.",
    "dicovernow": "Discover Now",

   "truststructure": "Open and Transparent On-Chain Architecture, Unwavering Trust Commitment",
   "truststructureDESC": "Our brand represents the synergy between licensed trust institutions and blockchain technology teams, providing on-chain trust solutions for families and institutions across multiple jurisdictions. It focuses on three core elements — our settlors and beneficiaries, cooperating fiduciary institutions, as well as the developers and node communities supporting the network operation. We adhere to long-termism, maintain trust relationships among all parties within a compliant framework, uphold the principles of security, transparency, and auditability, and continuously deliver reliable professional capabilities and a global service network.",
   "truststructureButton": "Learn More",

   "rules": "Configurable Beneficiary & Timing Rules",
   "rulesdesc": "Embed 'who receives, how much, and when' into the smart contract: supporting installments, cliff periods, and event triggers, with verifiable distribution for multiple beneficiaries",
   "rule1": "Multiple Beneficiaries: Proportional/fixed-amount distribution, with real-time verification that the total equals 100%",
   "rule2": "Flexible Timing: Lump sum / Cliff + linear vesting / Phased / Periodic",
   "rule3": "Conditional Triggers: Dates, governance approval, or on-chain proof of external events",

"insights": "Leading Insights",
"insight1": "How Blockchain Reshapes Private Wealth Management and Trust Structures",
"insight2": "Digital Assets and Trusts: Four Key Questions Investors Need to Address",
"insight3": "From a Bank's Perspective: How Cryptocurrency Trust Solutions Operate",

"location": "Locations",
"locationdesc": "We have established service hubs in major wealth management centers such as Hong Kong, Singapore, and Japan, in collaboration with multiple licensed trust institutions and regulatory compliance partners. Meanwhile, we deploy nodes and infrastructure across major global public blockchains. Regardless of where clients are located, they can remotely set up, manage, and audit their on-chain trust structures through decentralized wallets.",
"locationbutton": "Consult with Experts"

  },
  "cases": {
    "case1": "AI Agent Smart Matching: Multi-Source Precision Lead Generation for Orthodontic Equipment",
    "case1desc": "This case demonstrates how AI Agent + data intelligence matching technology helps medical device exporters accurately acquire potential customer information and enhance sales efficiency. The client initially relied on social media ads and manual data matching, facing challenges such as a limited market size and inefficient information collection. By leveraging AI Agent for automated data integration, intelligent contact matching, and personalized outreach, the solution significantly improved sales efficiency and marketing effectiveness, enabling the client to stand out in a competitive market.",
    "case2": "AI Agent Smart Filtering: Multi-Source Precision Sugar Mill Executive Identification",
    "case2desc": "This case demonstrates how AI Agent + Multi-Source Intelligent Matching technology helps a sugar trade client accurately identify and acquire contact information for key executives at overseas sugar mills, enhancing supply chain expansion efficiency. The client previously relied on industry networks and trade events to find suppliers, facing challenges such as limited coverage and inefficient information collection. By leveraging AI Agent for automated data integration, intelligent executive contact matching, and cross-platform social data verification, the client significantly improved sugar mill identification and sales engagement, accelerating international market expansion.",
    "case3": "AI-driven Smart Identification of KOL IP Attributes and Precision Outreach",
    "case3desc": "This case demonstrates how AI Agent + Chain of Thought technology helps businesses accurately acquire KOL/KOC resources on social media platforms like TikTok and Douyin, improving lead generation efficiency. The company previously relied on MCN agencies for manual selection and communication with influencers, facing challenges such as slow acquisition, high costs, and lack of data transparency. By leveraging AI Agents for automated data extraction, intelligent creator matching, and personalized outreach, the company significantly increased lead acquisition speed, reduced marketing costs, and optimized long-term collaboration strategies, enabling efficient brand expansion in the global market.",
    "case4": "Precise Identification of Customer Demand Comments and AI Agent Expert System for Lead Generation",
    "case4desc": "This case demonstrates how AI Agent + Intelligent Demand Identification technology helps beauty chain stores precisely target potential customers with skin concerns and improve customer acquisition. The client previously relied on manual content marketing, facing challenges such as low efficiency, limited precision, and low engagement rates. By leveraging AI Agent for automated social media monitoring, intelligent personalized interactions, and targeted discount distribution, user engagement significantly increased, with discount requests reaching nearly 10%, effectively optimizing marketing efficiency and driving store growth."
  },
  "table": {
    "title": "AI Agent vs. Humans",
    "feature1": "24/7",
    "feature2": "Experienced Sales Replication without Training",
    "feature3": "Low cost",
    "button1": "Contact Us",
    "button2": "Watch Demo"
  },
  "contact": {
    "title": "Contact Us",
    "desc": "Our professional team is ready to answer all your questions about on-chain trusts, including the design of family and corporate trust structures, digital asset custody and profit distribution solutions, cross-border compliance requirements, and the migration of existing assets to the blockchain. Whether you are in the planning phase or already have a preliminary plan, we can provide you with one-on-one evaluation and advice.",
    "button1": "Contact the team now to embark on your on-chain trust journey.",
    "button2": "Or contact us directly.",
            "phone":"Phone",
        "email":"Email"
  },
  "familytrust": {
    "title": "Family Trust",
    "subtitle": "On-Chain Wealth Inheritance Hub",
    "content": "In collaboration with licensed trust institutions, we integrate the legal framework of traditional family trusts with blockchain technology. This enables long-term asset holding, automatic distribution, and full-process traceability within a compliant framework, providing families with a programmable wealth inheritance solution.",
    "whyus": "Why Choose Us",

    "dualFramework": "Dual Legal & Tech Framework",
    "dualFrameworkDesc": "Licensed partners handle traditional family trust contracts; we encode key clauses on-chain for legal validity & technical executability",
    "programmableRules": "Programmable Vesting",
    "programmableRulesDesc": "Supports time/ event/ proportion-based beneficiary schemes; e.g., kids unlock assets at a certain age, qualification, or predefined condition",
    "multiAssetManagement": "Unified Multi-Asset Management",
    "multiAssetManagementDesc": "Supports digital assets, on-chain securitized assets & future RWA — all managed/tracked via one on-chain trust framework",
    "privacyTransparency": "Balance of Privacy & Transparency",
    "privacyTransparencyDesc": "Key info visible to trustees/smart contracts; necessary transaction/audit records disclosed for privacy & auditability",
    "crossGenerational": "Cross-Gen Continuity & Flex Adjustment",
    "crossGenerationalDesc": "Settlor retains rule-update rights; no transfer/embezzle of trust assets — \"adjustable but not arbitrary retrieval\"",
  
    "moduleTwoTitle": "Typical Use Cases",
    "educationMilestoneFund": "Children's Education & Growth Milestone Fund",
    "educationMilestoneFundDesc": "Covers children's tuition fees, study-abroad expenses, or startup capital.",
    "educationMilestoneFundSetting": "Configurable: Phased automatic disbursement upon reaching a certain age or completing specified academic achievements.",
    "longTermLivingExpense": "Family Long-Term Living Expense Arrangement",
    "longTermLivingExpenseDesc": "Sets fixed periodic payments (e.g., monthly/annually) for spouses or elderly parents.",
    "longTermLivingExpenseSetting": "On-chain automatic execution, reducing human intervention and disputes.",
    "enterpriseEquityInheritance": "Family Enterprise Equity & Dividend Inheritance",
    "enterpriseEquityInheritanceDesc": "Puts the right to benefits from family enterprise equity into the trust contract.",
    "enterpriseEquityInheritanceSetting": "Automatic dividend distribution based on equity arrangements, avoiding conflicts over operation/benefit rights among descendants.",
    "riskProtectionAssetIsolation": "Risk Prevention & Asset Isolation",
    "riskProtectionAssetIsolationDesc": "Places core family assets in the trust to isolate operational or personal debt risks.",
    "riskProtectionAssetIsolationSetting": "On-chain visualized asset structure, facilitating stress tests and risk early warnings by professional teams.",

    "faqTitle": "Frequently Asked Questions (FAQ)",
    "q1": "What is the essential difference between on-chain family trusts and traditional family trusts?",
    "a1": "Legally structured on traditional trust frameworks with licensed trustees; the difference lies in asset custody and distribution logic encoded into smart contracts, enabling automatic execution, transparent traceability, and unified multi-asset management.",
    "q2": "Can I migrate my existing offline family trust to the chain?",
    "a2": "Yes. Within legal boundaries, we collaborate with the original trustee to sort and map existing trust clauses, migrate part or all assets to on-chain custody, while preserving the validity of original legal documents.",
    "q3": "Can rules be modified if family circumstances change?",
    "a3": "Modifications are allowed within pre-agreed authorities (e.g., adding beneficiaries, adjusting ratios, extending/shortening disbursement cycles); however, strict restrictions on \"retrieving trust assets\" remain to protect beneficiaries' rights.",
    "q4": "Is on-chain asset safe if I or the trustee encounters issues?",
    "a4": "Assets are held via multi-signature/hardware wallets, paired with contract-built emergency mechanisms (e.g., alternate trustees, arbitrators) to isolate personal and technical risks, preventing misappropriation due to single-party errors.",
    "q5": "Will it be complicated for family members unfamiliar with blockchain?",
    "a5": "The front-end interface resembles regular online banking; key signatures and on-chain operations are assisted by professional teams, with family members only needing to view and confirm via an intuitive Chinese interface."
  },

  "enterprise": {
    "title": "Enterprise Trust",
    "subtitle": "Build an On-Chain 'Safety Vault' for Company Assets & Equity",
    "content": "Integrate equity, cash flow, and digital assets into a unified on-chain trust framework. Use programmable rules to lock in control, incentivize core teams, connect with investors, and reduce governance risks.",
    "whyus": "Why Choose Us",
    "dualFramework": "Multi-Shareholder & Multi-Sig Governance",
    "dualFrameworkDesc": "Multi-party initiators can set joint decision-making rules, completing voting and execution of major matters via multi-signature and smart contracts.",
    "programmableRules": "Integrated Equity & Incentive Design",
    "programmableRulesDesc": "Connect ESOP/option pools, token pools with enterprise trust structure for unified management of 'equity + token' dual incentives.",
    "multiAssetManagement": "VC/Family Office Investment Structure Integration",
    "multiAssetManagementDesc": "Align with traditional equity investment agreements; on-chain partial rights and exit mechanisms to reduce information asymmetry and execution risks.",
    "privacyTransparency": "Financial Transparency & Audit-Friendly",
    "privacyTransparencyDesc": "All cash flows and asset distributions are on-chain trackable, facilitating annual audits, external disclosure, and improving corporate governance ratings.",
    "crossGenerational": "Flexible for Enterprises at All Stages",
    "crossGenerationalDesc": "Startups, mature family businesses, or offshore holding companies can all add an on-chain trust layer to existing structures.",

    "moduleTwoTitle": "Typical Use Cases",
    "educationMilestoneFund": "Equity Custody & Control Protection",
    "educationMilestoneFundDesc": "Custody founders' and core shareholders' equity in trust to prevent passive control transfer due to personal changes.",
    "longTermLivingExpense": "ESOP & Token Incentive Pools",
    "longTermLivingExpenseDesc": "Unified custody of options/tokens in trust contracts, with automatic release to employees per predefined vesting rules.",
    "enterpriseEquityInheritance": "Joint Venture & Profit Sharing",
    "enterpriseEquityInheritanceDesc": "Multiple companies co-establish project entities; embed profit-sharing clauses into on-chain trusts for automatic distribution per contracts.",
    "riskProtectionAssetIsolation": "Cross-Border Fund Management & Overseas Investment",
    "riskProtectionAssetIsolationDesc": "Unify enterprise overseas assets and investment returns into trust accounts for reinvestment or repatriation within compliant frameworks.",

    "moduleThreeTitle": "Frequently Asked Questions (FAQ)",
    "q1": "What types of companies are suitable for on-chain enterprise trusts?",
    "a1": "Especially for enterprises with cross-border structures, complex equity, needs for 'equity + token' dual incentives, or joint investments with multiple partners.",
    "q2": "Will it conflict with existing VIE/red-chip structures?",
    "a2": "No direct conflict. Trusts typically act at the equity or benefit right level; we collaborate with your legal advisors to ensure compatibility with existing structures.",
    "q3": "How to link employees' options/tokens with HR systems?",
    "a3": "Integrate with HR systems via API or regular data imports; on-chain automatic vesting and distribution trigger once employees meet eligibility criteria.",
    "q4": "Must enterprises hold crypto assets?",
    "a4": "No. Start with 'legal trust + regular accounts' and gradually introduce digital assets later, or directly adopt stablecoins for on-chain access.",
    "q5": "How to coordinate with audit and tax requirements?",
    "a5": "We provide standardized reports combined with on-chain data to assist your auditors and tax advisors in compliant filings."
  },

  "dao": {
    "title": "DAO Governance",
    "subtitle": "Trusted Custody & Rule Execution for Decentralized Organizations",
    "content": "Connect DAO treasuries, governance rules with real-world legal structures, striking a balance between compliance and autonomy through \"token voting + trust framework\".",

    "whyus": "Why Choose Us",
    "dualFramework": "Treasury Custody & Multi-Sig Management",
    "dualFrameworkDesc": "DAO treasury assets are custodied in trust contracts; multi-signers are jointly appointed by the community and partners to mitigate single-point failure risks.",
    "programmableRules": "Enforceable On-Chain Governance Rules",
    "programmableRulesDesc": "Bind voting results to smart contracts, enabling clear workflows: \"Voting Approved → Auto-Execution\" or \"Trigger Trustee Execution\".",
    "multiAssetManagement": "Compliant Real-World Entity Integration",
    "multiAssetManagementDesc": "Connect with foundations, companies, or trust entities to provide legal interfaces for DAOs' real-world actions (contract signing, employment, invoicing, equity holding).",
    "privacyTransparency": "Anti-51% Tyranny & Malicious Governance Attacks",
    "privacyTransparencyDesc": "Set protection mechanisms for critical matters at the trust level (e.g., cooling-off periods, multi-thresholds) to prevent short-term speculative control of DAO direction.",
    "crossGenerational": "Transparent & Auditable Community Trust Foundation",
    "crossGenerationalDesc": "Community members can real-time track fund flows and execution status, building long-term trust and participation motivation.",

    "moduleTwoTitle": "Typical Use Cases",
    "educationMilestoneFund": "DAO Treasury Management & Budget Execution",
    "educationMilestoneFundDesc": "Custody ecosystem funds, incentive capital, and operating budgets in trust contracts; disburse funds per governance voting results.",
    "longTermLivingExpense": "Community Incentives & Contribution Rewards",
    "longTermLivingExpenseDesc": "Unified distribution of task rewards and long-term contributor incentives via trust treasury, avoiding arbitrary token allocation.",
    "enterpriseEquityInheritance": "Protocol Fee & Royalty Distribution",
    "enterpriseEquityInheritanceDesc": "Protocol-generated fees or NFT royalties directly enter the treasury, with regular distribution to different pools per community-defined ratios.",
    "riskProtectionAssetIsolation": "DAO & Traditional Institution Collaboration",
    "riskProtectionAssetIsolationDesc": "When partnering with exchanges, funds, or enterprises, the trust entity acts as the signing party to reduce compliance and liability ambiguity risks.",

    "moduleThreeTitle": "Frequently Asked Questions (FAQ)",
    "q1": "Will DAO funds lose 'decentralization' when held in trust?",
    "a1": "Trusts do not replace DAOs but serve as execution and risk isolation layers. Decisions remain community-voted; trusts only execute per pre-agreed rules and provide legal interfaces.",
    "q2": "Who acts as the trustee?",
    "a2": "Licensed trust companies or professional institutions, depending on jurisdictions; multi-trustee structures are available for specific scenarios.",
    "q3": "How are voting results linked to trust execution?",
    "a3": "Voting results are written into execution contracts via preset smart contracts and oracle/multi-sig processes; trusts release or transfer funds based on these results.",
    "q4": "How to control legal risks with globally distributed DAO members?",
    "a4": "Select suitable trust jurisdictions and have compliance advisors assess project nature to reduce individual members' direct legal liability risks.",
    "q5": "Do existing DAOs need to be rebuilt?",
    "a5": "No need for full reconstruction. Start with 'treasury custody + key process on-chaining' and gradually upgrade to a complete DAO + trust framework."
  },
"rwa": {
    "title": "RWA Configuration",
    "subtitle": "Bring Real-World Assets to On-Chain Trusts",
    "content": "In collaboration with licensed institutions and professional issuers, on-chain real assets (real estate, equity, bonds, notes, etc.) via compliant methods, integrating them into trusts for unified allocation and distribution.",
    
    "whyus": "Why Choose Us",
    "dualFramework": "Compliance-First RWA Selection System",
    "dualFrameworkDesc": "Prioritize RWA products with clear legal structures, custody arrangements, and disclosure mechanisms to reduce underlying asset opacity risks.",
    "programmableRules": "Multi-Asset Portfolio Allocation Capability",
    "programmableRulesDesc": "Combine stablecoins, government bonds, money market fund shares, real estate income rights, and other assets within a single on-chain trust.",
    "multiAssetManagement": "Automated & Visualized Return Distribution",
    "multiAssetManagementDesc": "Interest, rent, or dividends from RWAs automatically enter the trust and are distributed to beneficiaries per preset ratios.",
    "privacyTransparency": "Enhanced Cross-Border Investment & Repatriation",
    "privacyTransparencyDesc": "Reduce intermediate layers via on-chain settlement to improve cross-border asset investment and return repatriation efficiency.",
    "crossGenerational": "Risk Isolation & Real-Time Monitoring",
    "crossGenerationalDesc": "Dual-layer structure (trust entity + on-chain contract) for risk isolation; real-time track asset performance and concentration via dashboards.",

    "moduleTwoTitle": "Typical Use Cases",
    "educationMilestoneFund": "Stable Return Pool for HNWIs",
    "educationMilestoneFundDesc": "Allocate short-term bonds, money market funds, high-quality notes, etc., in on-chain trusts to generate stable cash flow.",
    "longTermLivingExpense": "Family Enterprise Global Asset Layout",
    "longTermLivingExpenseDesc": "Integrate overseas real estate rent, foreign equity dividends, etc., into a unified RWA pool for automatic distribution to family members or shareholders.",
    "enterpriseEquityInheritance": "Low-Risk Fund Management for DAOs/Foundations",
    "enterpriseEquityInheritanceDesc": "Allocate part of raised funds to compliant RWA products (beyond operational needs) to enhance treasury volatility resistance.",
    "riskProtectionAssetIsolation": "Long-Term Goal Funds (Pension/Education)",
    "riskProtectionAssetIsolationDesc": "Establish 'target-date' RWA portfolios for children's education or parents' pensions, with dynamic risk adjustments over time.",

    "moduleThreeTitle": "Frequently Asked Questions (FAQ)",
    "q1": "Who issues and custodies RWAs?",
    "a1": "Issued by licensed financial institutions or professional issuers, and custodied with corresponding banks, brokers, or trust institutions; we handle integration and on-chain mapping.",
    "q2": "What is the investment threshold?",
    "a2": "Thresholds vary by product; we design tailored allocation plans based on your asset scale and regulatory requirements.",
    "q3": "How are RWA returns accounted for?",
    "a3": "Returns are automatically recorded in on-chain trust accounts, displayed in both fiat and token valuations on the front-end for easy reconciliation and tax filing.",
    "q4": "Are there additional legal and tax risks?",
    "a4": "Like any cross-border investment, it must align with local legal and tax rules; we collaborate with your advisors for assessment.",
    "q5": "What if the issuer encounters issues?",
    "a5": "Trust structures and custody arrangements isolate risks from issuers to a certain extent; diversified allocation reduces single-product risks."
  },
  "vesting": {
    "title": "Vesting & Custody",
    "subtitle": "Build Trusted Timelocks for Equity & Token Release",
    "content": "Custody equity, tokens, and incentive pools in trust contracts. Protect long-term interests of project parties, investors, and core teams with transparent vesting rules and timelock mechanisms.",
    
    "whyus": "Why Choose Us",
    "dualFramework": "On-Chain Verifiable Vesting Plans",
    "dualFrameworkDesc": "All lock-up and unlock rules are public on-chain, verifiable by anyone, eliminating the need for 'manual market persuasion'.",
    "programmableRules": "Equity & Token Dual-Asset Support",
    "programmableRulesDesc": "Simultaneously manage equity-linked benefit rights and token rewards, with unified display and tracking in a single front-end interface.",
    "multiAssetManagement": "Exchange & Fund Integration-Friendly",
    "multiAssetManagementDesc": "Clear vesting structure and custody arrangements facilitate passing exchange reviews and gaining institutional investor trust.",
    "privacyTransparency": "Prevent Unilateral Unlock or Exit",
    "privacyTransparencyDesc": "Project parties cannot bypass contracts for early unlock; major changes require multi-party approval per preset procedures.",
    "crossGenerational": "Flexible for Multiple Incentive Models",
    "crossGenerationalDesc": "Supports multiple vesting designs: cliff period, linear release, performance-triggered release, etc.",
    
    "moduleTwoTitle": "Typical Use Cases",
    "educationMilestoneFund": "Founding Team Token/Equity Lock-Up",
    "educationMilestoneFundDesc": "4-year vesting period + 1-year cliff to enhance market confidence in the project's long-term commitment.",
    "longTermLivingExpense": "Early Investor Unlock Plan",
    "longTermLivingExpenseDesc": "Clarify unlock schedules for investors to avoid short-term concentrated selling pressure and information opacity.",
    "enterpriseEquityInheritance": "Ecosystem Incentives & Advisor Rewards",
    "enterpriseEquityInheritanceDesc": "Custody marketing budgets, ecosystem incentives, and advisor fees in trust contracts, released based on contribution or time.",
    "riskProtectionAssetIsolation": "Employee Incentives & Termination Mechanism",
    "riskProtectionAssetIsolationDesc": "Unvested portions are handled per preset rules in case of employee resignation or breach, avoiding ad-hoc negotiations.",
    
    "moduleThreeTitle": "Frequently Asked Questions (FAQ)",
    "q1": "Can vesting rules be modified after being written on-chain?",
    "a1": "A 'modification channel' can be reserved during design—e.g., changes require approval from the board/DAO/investors; unilateral modification is not allowed under normal circumstances.",
    "q2": "What if the project is terminated or a major incident occurs?",
    "a2": "Emergency clauses can be preset; trust trustees or multi-signature committees execute liquidation or restructuring plans when specific conditions are met.",
    "q3": "How can employees check their vesting status?",
    "a3": "Employees can view vested, unvested amounts and expected unlock time via personal dashboards, without understanding blockchain underlying details.",
    "q4": "Will exchanges recognize this custody solution?",
    "a4": "Most major exchanges prefer clear lock-up and unlock structures; we can assist in preparing required documentation.",
    "q5": "Can only tokens be custodied?",
    "a5": "No—equity-linked benefit rights, dividend rights, and other contractual rights can also be custodied."
  },

   "compliance": {
    "title": "Cross-Border Compliance Collaboration",
    "subtitle": "Simplify & Secure Global Asset Flow",
    "content": "Under multi-jurisdictional regulatory frameworks, coordinate collaboration between trusts, funds, companies, and on-chain contracts to build a sustainable cross-border asset management solution for you.",
    "whyus": "Why Choose Us",
    "dualFramework": "Multi-Region Cooperation Network",
    "dualFrameworkDesc": "Long-term partnerships with licensed institutions and legal advisors in Hong Kong, Singapore, European offshore centers, etc.",
    "programmableRules": "On-Chain & Offline Integrated Perspective",
    "programmableRulesDesc": "Not only focus on smart contracts, but also their relationships with account structures, tax residency, and reporting obligations.",
    "multiAssetManagement": "Compliance-Friendly Product Design",
    "multiAssetManagementDesc": "Incorporate regulatory requirements during strategy design to reduce post-implementation rectification costs and legal uncertainties.",
    "privacyTransparency": "Standardized Documents & Audit Support",
    "privacyTransparencyDesc": "Provide standardized documents and data views required for docking with banks, brokers, auditors, and tax authorities.",
    "crossGenerational": "Continuous Regulatory Change Tracking",
    "crossGenerationalDesc": "Monitor regulatory trends in major regions, adjust contract parameters and operating procedures timely to reduce policy risks.",

    "moduleTwoTitle": "Typical Use Cases",
    "educationMilestoneFund": "Cross-Border Family Asset Restructuring",
    "educationMilestoneFundDesc": "Family members distributed across countries with assets in different regions, requiring unified on-chain trust structure and tax planning.",
    "longTermLivingExpense": "Blockchain Fund/Crypto Private Placement Compliance",
    "longTermLivingExpenseDesc": "Build acceptable trust or fund structures for investors, matching on-chain operations and disclosure mechanisms.",
    "enterpriseEquityInheritance": "Enterprise Global Expansion & Overseas Financing",
    "enterpriseEquityInheritanceDesc": "Enterprises hold overseas assets through offshore SPVs and trusts, combining with on-chain contracts to realize equity/debt financing.",
    "riskProtectionAssetIsolation": "Long-Term Immigration & Status Planning",
    "riskProtectionAssetIsolationDesc": "Cooperate with immigration consultants to balance asset security and tax connection before and after status changes.",
 
    "moduleThreeTitle": "Frequently Asked Questions (FAQ)",
    "q1": "Do you provide legal or tax advice?",
    "a1": "We focus on product structure and on-chain execution, and do not directly provide legal or tax advice, but we will collaborate with your lawyers and tax consultants.",
    "q2": "Regulatory requirements vary greatly across countries—can they be unified?",
    "a2": "Complete unification is impossible, but the combined design of trust + company + on-chain contract can simplify the structure as much as possible under compliance premises.",
    "q3": "Do banks accept funds related to on-chain trusts?",
    "a3": "It depends on specific banks and regions. We will help prepare compliance materials to improve approval rates, but do not guarantee results from individual institutions.",
    "q4": "If I already have an overseas company and account, do I still need a trust?",
    "a4": "Companies are responsible for operations and external business, while trusts are more suitable for asset holding and inheritance—they complement rather than replace each other.",
    "q5": "How long is the setup cycle?",
    "a5": "It depends on the jurisdiction and solution complexity. Generally, it takes several weeks to several months from demand confirmation to structure implementation."
  },

  "footer": {
    "section1_title": "Company",
    "section1_subtitle1": "About Us",
    "section2_title": "Resources",
    "section2_subtitle1": "Documents",
    "section2_subtitle2": "Terms of Service",
    "section3_title": "Contact"
  },
   "about": {
    "heroTitle": "About Us & Compliance Framework",
    "heroSubtitle": "We combine traditional trust systems with blockchain technology to build secure, transparent, and auditable on-chain trust infrastructure for families and institutions within clear legal and regulatory frameworks",
    "whoWeAreSectionTitle": "Who we are",
    "whoWeAreDescription": "We are a team focused on 'on-chain trust and compliance architecture design'. Our core members come from fields such as trust and private wealth planning, compliance and risk control, blockchain technology, and product design, serving high-net-worth families, cross-border enterprises, crypto funds, and decentralized organizations (DAOs) for a long time",
    "whoWeAreRoleIntro": "Our role is not to make investment decisions on behalf of trustees, but to:",
    "whoWeAreRole1Title": "Translate traditional trust deeds into executable on-chain rules",
    "whoWeAreRole1Content": "Abstract core clauses such as benefit distribution, time locks, and permission settings into smart contract logic",
    "whoWeAreRole2Title": "Provide a technical 'foundation' for licensed trustees and clients",
    "whoWeAreRole2Content": "Offer multi-signature and hardware custody solutions, on-chain operation processes, and audit-friendly data views",
    "whoWeAreRole3Title": "Connect the Web2 legal world and the Web3 asset world",
    "whoWeAreRole3Content": "Enable trust assets to comply with the legal requirements of their jurisdiction while enjoying the advantages of on-chain transparency and efficient settlement",
    "whoWeAreBelief": "We believe: Compliance and innovation are not contradictory. Truly sustainable on-chain trusts must, on the premise of respecting regulatory and legal boundaries, use technology to 'reduce trust costs and improve execution efficiency' rather than confront regulation",
    "cooperationSectionTitle": "Cooperation & Licensing (How to ensure compliance)",
    "cooperationCard1Title": "Licensed Trustees & Legal Entities",
    "cooperationCard1Content": "Every on-chain trust structure is backed by a clear legal entity: Licensed trust companies, regulated financial institutions, or professional service providers in different jurisdictions act as trustees. We are responsible for technical implementation and process management, and do not replace the legal liabilities of trustees, ensuring clear and traceable responsibilities",
    "cooperationCard2Title": "Asset Custody & Account Security",
    "cooperationCard2Content": "Traditional financial assets (cash, securities, funds, etc.) continue to be held by banks, securities firms, or independent custodians; Crypto assets adopt multi-signature wallets, hardware key management, or qualified custodian custody; All custody arrangements are clearly stated in the trust deed or supplementary agreement, with verifiable records left on-chain",
    "cooperationCard3Title": "KYC / AML & Compliance Processes",
    "cooperationCard3Content": "Customer identification, source of funds verification, sanctions list screening, and other KYC/AML processes are led by licensed partner institutions; We provide them with digital workflows, risk labels, and log recording tools to help meet local regulatory requirements for ongoing due diligence",
    "cooperationCard4Title": "One-to-One Correspondence between Legal Documents & Smart Contracts",
    "cooperationCard4Content": "Each on-chain trust product has a corresponding trust deed, private placement memorandum, or service agreement as the legal basis; Before smart contract deployment, they are reviewed by cooperating law firms and technical teams to ensure consistency between clause meanings and code behavior; Complete records are kept for contract version changes and key parameter adjustments to facilitate auditing and dispute resolution",
    "cooperationCard5Title": "Audit, Reporting & Regulatory Integration",
    "cooperationCard5Content": "Output standardized reports and data interfaces to support auditors, regulators, and clients in reconciliation and penetrative viewing; Where possible, integrate with compliant on-chain analysis tools to assist in identifying abnormal transactions and sanctions risks; Through a dashboard interface, make 'trust asset structure, capital flow, and profit distribution' clear at a glance",
    "keyComplianceTitle": "Key Compliance Highlights",
    "keyCompliance1": "Licensed trustees assume legal liabilities",
    "keyCompliance2": "Separation of asset custody and contract logic",
    "keyCompliance3": "End-to-end KYC / AML processes",
    "keyCompliance4": "Dual constraints of contract terms and smart contracts",
    "keyCompliance5": "Audit-friendly data and reports",
    "riskSectionTitle": "Risk disclosure & terms",
    "risk1Title": "General Disclaimer",
    "risk1Content": "All content displayed on this page and platform is for illustrative purposes of product structures and technical solutions only, and does not constitute any form of investment advice, legal advice, or tax advice. Before making any investment, asset allocation, or architecture setup decisions, you should consult your own lawyers, tax advisors, and other independent professionals",
    "risk2Title": "Market & Price Risk",
    "risk2Content": "Accounts denominated in digital assets may experience significant market value changes due to market volatility, and even principal loss; Configurations based on RWAs or other financial products also carry credit risk, liquidity risk, and the risk of underperforming returns; Past performance or simulated backtests do not guarantee future results",
    "risk3Title": "Technology & Operational Risk",
    "risk3Content": "Blockchain networks, smart contracts, oracles, multi-signature wallets, and other technical components may experience service interruptions or asset damage due to vulnerabilities, congestion, attacks, or other unforeseen reasons; On-chain transactions are usually irreversible, and losses resulting from operational errors, private key leaks, device loss, etc., may not be recoverable through technical means; Although we will adopt reasonable security measures and audit processes, we cannot guarantee that the system is completely free of defects",
    "risk4Title": "Regulatory & Policy Risk",
    "risk4Content": "Regulatory requirements for trusts, digital assets, stablecoins, RWAs, and cross-border capital flows vary across countries/regions and may change over time; Regulatory changes may affect the ongoing compliance, tax treatment, and even lead to service adjustments or termination of certain products or structures; You are responsible for understanding and complying with the relevant legal provisions of your tax residency and source of funds",
    "risk5Title": "Third-Party Institution Risk",
    "risk5Content": "Our services rely on multiple partner institutions such as trust companies, banks, securities firms, custodians, and technical service providers; If any third-party institution encounters operational, compliance, or technical issues, it may affect asset liquidity, service continuity, or information integrity; To the extent permitted by law, we do not assume direct liability for the independent actions of third-party institutions",
    "risk6Title": "Eligible Clients & Geographical Restrictions",
    "risk6Content": "Some of our products and structures are only available to professional/qualified clients who meet the requirements of their jurisdiction; Due to regulatory or sanctions requirements, we may not provide services to residents or institutions in specific countries/regions; Before using this platform, you should confirm that your identity and source of funds comply with applicable laws and regulations",
    "risk7Title": "Priority & Updates of Terms",
    "risk7Content": "If there is any inconsistency between the content displayed on this page and the legally binding documents you actually sign (such as trust deeds, service agreements), the formally signed legal documents shall prevail; We reserve the right to update platform terms, product structures, and risk disclosures to the extent permitted by law, and the updated content shall take effect from the date of publication; Continued use of this platform constitutes your acknowledgment and acceptance of the latest versions of the Terms of Service, Privacy Policy, and this Risk Disclosure & Terms summary"
  }
}